In [2]:
import sklearn
from matplotlib import pyplot as plt
import pandas as pd
import numpy as np

In [3]:
data=pd.read_csv("aapl.csv",parse_dates=["Date"])

In [4]:
data

          Date    Open    High     Low   Close    Volume
0   2017-07-07  142.90  144.75  142.90  144.18  19201712
1   2017-07-06  143.02  143.50  142.41  142.73  24128782
2   2017-07-05  143.69  144.79  142.72  144.09  21569557
3   2017-07-03  144.88  145.30  143.10  143.50  14277848
4   2017-06-30  144.45  144.96  143.78  144.02  23024107
..         ...     ...     ...     ...     ...       ...
246 2016-07-15   98.92   99.30   98.50   98.78  30136990
247 2016-07-14   97.39   98.99   97.32   98.79  38918997
248 2016-07-13   97.41   97.67   96.84   96.87  25892171
249 2016-07-12   97.17   97.70   97.12   97.42  24167463
250 2016-07-11   96.75   97.65   96.73   96.98  23794945

[251 rows x 6 columns]

In [5]:
data.set_index("Date",inplace=True)

In [6]:
data

              Open    High     Low   Close    Volume
Date
2017-07-07  142.90  144.75  142.90  144.18  19201712
2017-07-06  143.02  143.50  142.41  142.73  24128782
2017-07-05  143.69  144.79  142.72  144.09  21569557
2017-07-03  144.88  145.30  143.10  143.50  14277848
2017-06-30  144.45  144.96  143.78  144.02  23024107
...            ...     ...     ...     ...       ...
2016-07-15   98.92   99.30   98.50   98.78  30136990
2016-07-14   97.39   98.99   97.32   98.79  38918997
2016-07-13   97.41   97.67   96.84   96.87  25892171
2016-07-12   97.17   97.70   97.12   97.42  24167463
2016-07-11   96.75   97.65   96.73   96.98  23794945

[251 rows x 5 columns]

In [7]:
data.loc["2017/07"]

              Open    High     Low   Close    Volume
Date
2017-07-07  142.90  144.75  142.90  144.18  19201712
2017-07-06  143.02  143.50  142.41  142.73  24128782
2017-07-05  143.69  144.79  142.72  144.09  21569557
2017-07-03  144.88  145.30  143.10  143.50  14277848

In [8]:
data.loc["2016/07"]

              Open    High     Low   Close    Volume
Date
2016-07-29  104.19  104.55  103.68  104.21  27733688
2016-07-28  102.83  104.45  102.82  104.34  39869839
2016-07-27  104.26  104.35  102.75  102.95  92344820
2016-07-26   96.82   97.97   96.42   96.67  56239822
2016-07-25   98.25   98.84   96.92   97.34  40382921
2016-07-22   99.26   99.30   98.31   98.66  28313669
2016-07-21   99.83  101.00   99.13   99.43  32702028
2016-07-20  100.00  100.46   99.74   99.96  26275968
2016-07-19   99.56  100.00   99.34   99.87  23779924
2016-07-18   98.70  100.13   98.60   99.83  36493867
2016-07-15   98.92   99.30   98.50   98.78  30136990
2016-07-14   97.39   98.99   97.32   98.79  38918997
2016-07-13   97.41   97.67   96.84   96.87  25892171
2016-07-12   97.17   97.70   97.12   97.42  24167463
2016-07-11   96.75   97.65   96.73   96.98  23794945

In [9]:
data.loc["2017/07/06"]

Open           143.02
High           143.50
Low            142.41
Close          142.73
Volume    24128782.00
Name: 2017-07-06 00:00:00, dtype: float64

In [10]:
data.loc["2017/07"]["Open"]

Date
2017-07-07    142.90
2017-07-06    143.02
2017-07-05    143.69
2017-07-03    144.88
Name: Open, dtype: float64

In [12]:
data.loc["2017/07"]["Open"].mean()

143.6225

In [13]:
data.loc["2017/07"]["Open"].std()

0.907537877997381

convert date and time to timestamp format

In [15]:
date="jan/2019/07"
pd.to_datetime(date)

Timestamp('2019-01-07 00:00:00')

In [16]:
date="2019/2/22"
pd.to_datetime(date)

Timestamp('2019-02-22 00:00:00')

In [17]:
date="3-8-2020"
pd.to_datetime(date)

Timestamp('2020-03-08 00:00:00')

In [23]:
date="3/5/2020 2:30pm"
pd.to_datetime(date)

Timestamp('2020-03-05 14:30:00')

In [24]:
date="18/12/17"
pd.to_datetime(date,yearfirst=True)

Timestamp('2018-12-17 00:00:00')

In [25]:
pd.to_datetime(date,dayfirst=True)

Timestamp('2017-12-18 00:00:00')

In [26]:
pd.to_datetime(date,yearsecond=True)

TypeError: to_datetime() got an unexpected keyword argument 'yearsecond'